Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcretePolygon
Defines parameters for Concrete Polygon structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteL
Defines parameters for Concrete L structural sections.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape.ConcreteI
Defines parameters for Concrete I structural sections.